{
  "movies": [
    {
      "date": "2019",
      "description": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
      "director": "Robert Rodriguez",
      "id": 1,
      "image": "poster_alita.jpg",
      "rating": "67",
      "title": "Alita : Battle Angel"
    },
    {
      "date": "17 Agustus 1945",
      "description": "Once home to the most advanced civilization on Earth, Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people and then the surface world. Standing in his way is Arthur Curry, Orm\u0027s half-human, half-Atlantean brother and true heir to the throne.",
      "director": "James Wan",
      "id": 2,
      "image": "poster_aquaman.jpg",
      "rating": "9.5",
      "title": "Aquaman"
    },
    {
      "date": "17 Agustus 1945",
      "description": "lSinger Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock \u0027n\u0027 roll band Queen in 1970. Hit songs become instant classics. When Mercury\u0027s increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
      "director": "",
      "id": 3,
      "image": "poster_bohemian.jpg",
      "rating": "9.5",
      "title": "Bohemian Rhapsody"
    },
    {
      "date": "17 Agustus 1945",
      "description": "Between personal obligations and training for his next big fight against an opponent with ties to his family\u0027s past, Adonis Creed is up against the challenge of his life.",
      "director": "Steven Caple Jr.",
      "id": 4,
      "image": "poster_creed.jpg",
      "rating": "9.5",
      "title": "Creed II"
    },
    {
      "date": "2018",
      "description": "Gellert Grindelwald has escaped imprisonment and has begun gathering followers to his cause—elevating wizards above all non-magical beings. The only one capable of putting a stop to him is the wizard he once called his closest friend, Albus Dumbledore. However, Dumbledore will need to seek help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander, who agrees to help, unaware of the dangers that lie ahead. Lines are drawn as love and loyalty are tested, even among the truest friends and family, in an increasingly divided wizarding world.",
      "director": "David Yates",
      "id": 5,
      "image": "poster_crimes.jpg",
      "rating": "9.5",
      "title": "The Crimes Of Grindelwald"
    },
    {
      "date": "2019",
      "description": "In a series of escalating encounters, former security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities. Meanwhile, the shadowy presence of Elijah Price emerges as an orchestrator who holds secrets critical to both men.",
      "director": "M. Night Shyamalan",
      "id": 6,
      "image": "poster_glass.jpg",
      "rating": "9.5",
      "title": "Glass"
    },
    {
      "date": "2019",
      "description": "As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless’ discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup’s reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.",
      "director": "Dean DeBlois",
      "id": 7,
      "image": "poster_how_to_train.jpg",
      "rating": "76",
      "title": "How To Train Your Dragon : The Hidden World"
    },
    {
      "date": "2018",
      "description": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
      "director": "Joe Russo",
      "id": 8,
      "image": "poster_infinity_war",
      "rating": "83",
      "title": "Avengers : Infinity War"
    },
    {
      "date": "2018",
      "description": "After being defeated by Ip Man, Cheung Tin Chi is attempting to keep a low profile. While going about his business, he gets into a fight with a foreigner by the name of Davidson, who is a big boss behind the bar district. Tin Chi fights hard with Wing Chun and earns respect.",
      "director": "Yuen Woo-ping",
      "id": 9,
      "image": "poster_master_z.jpg",
      "rating": "52",
      "title": "Master Z: Ip Man Legacy"
    },
    {
      "date": "17 Agustus 1945",
      "description": "Many thousands of years in the future, Earth’s cities roam the globe on huge wheels, devouring each other in a struggle for ever diminishing resources. On one of these massive traction cities, the old London, Tom Natsworthy has an unexpected encounter with a mysterious young woman from the wastelands who will change the course of his life forever.",
      "director": "Christian Rivers",
      "id": 10,
      "image": "poster_mortal_engines.jpg",
      "rating": "9.5",
      "title": "Mortal Engines"
    },
    {
      "date": "2015",
      "description": "In the year 2138, virtual reality gaming is booming. Yggdrasil, a popular online game is quietly shut down one day. However, one player named Momonga decides to not log out. Momonga is then transformed into the image of a skeleton as \"the most powerful wizard.\" The world continues to change, with non-player characters (NPCs) beginning to feel emotion. Having no parents, friends, or place in society, this ordinary young man Momonga then strives to take over the new world the game has become.",
      "director": "Yumi Hara",
      "id": 11,
      "image": "poster_overlord.jpg",
      "rating": "75",
      "title": "Overlord"
    },
    {
      "date": "17 Agustus 1945",
      "description": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope\u0027s video game, \"Sugar Rush.\" In way over their heads, Ralph and Vanellope rely on the citizens of the internet -- the netizens -- to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.",
      "director": "Phil Johnston",
      "id": 12,
      "image": "poster_ralph.jpg",
      "rating": "9.5",
      "title": "Ralph Breaks The Internet"
    },
    {
      "date": "2018",
      "description": "A war-hardened Crusader and his Moorish commander mount an audacious revolt against the corrupt English crown.",
      "director": "Ben Chandler",
      "id": 13,
      "image": "poster_robin_hood.jpg",
      "rating": "72",
      "title": "Robin Hood"
    },
    {
      "date": "2019",
      "description": "Baker Dill is a fishing boat captain leading tours off a tranquil, tropical enclave called Plymouth Island. His quiet life is shattered, however, when his ex-wife Karen tracks him down with a desperate plea for help.",
      "director": "Steven Knight",
      "id": 14,
      "image": "poster_serenity.jpg",
      "rating": "51",
      "title": "Serenity"
    },
    {
      "date": "2018",
      "description": "Miles Morales is juggling his life between being a high school student and being a spider-man. When Wilson \"Kingpin\" Fisk uses a super collider, others from across the Spider-Verse are transported to this dimension.",
      "director": "Rodney Rothman",
      "id": 15,
      "image": "poster_spiderman.jpg",
      "rating": "9.5",
      "title": "Spider-Man : Into The Spider-Verse"
    },
    {
      "date": "2018",
      "description": "In 1944, a courageous group of Russian soldiers managed to escape from German captivity in a half-destroyed legendary T-34 tank. Those were the times of unforgettable bravery, fierce fighting, unbreakable love, and legendary miracles.",
      "director": "Aleksey Sidorov",
      "id": 16,
      "image": "poster_t34.jpg",
      "rating": "9.5",
      "title": "T34"
    }
  ]
}